InformationRegisters/НастройкиПродленияСроковНалоговОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПродленияСроковНалоговОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МерыУстойчивогоРазвития</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерыУстойчивогоРазвитияМикро</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаетВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПеренестиСрокиОтчетовВФонды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыУСНЗа2019Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыУСНЗа1Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыУСНЗа2Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыУСНЗа3Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыЕНВДЗа1Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыЕНВДЗа2Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУплатыЕНВДЗа3Кв2020</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеятельностьОтнесенаКПострадавшимОтКоронавируса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОснованияПродленияСроковНалоговОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ОснованияПродленияСроковНалоговОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1аАбз1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1аАбз2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1аАбз3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1аАбз4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1аАбз5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1б</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1бИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП1в</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП3Абз1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МерыУстойчивогоРазвитияП3Абз2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постановление212ПП_П2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазъясненияФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазъясненияМинюста</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПродленияСроковНалоговОтчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает настройки для переноса сроков уплаты налогов и представления отчетов для организации
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, для которой требуется получить настройки
// 
// Возвращаемое значение:
//   Структура - см. НовыйНастройкиПродленияСроков, поля:
//     * ОснованияПродления          - Массив из ПеречислениеСсылка.ОснованияПродленияСроковНалоговОтчетов
//     * РаботаетВНерабочиеДни       - Булево - признак, что организация работает в дни, объявленные нерабочими
//     * ПеренестиСрокиОтчетовВФонды - Булево - признак, что для организации нужно переносить сроки сдачи отчетов в ФСС и ПФР
//     * ПравилаОтчетовВФонды        - Массив из Строка - правила сдачи отчетов в фонды, для которых предусмотрен особый порядок переноса
//     * ПравилаБезПереносаСроков    - Массив из Строка - правила, для которых не предусмотрен перенос сроков
//
Функция ПараметрыПродленияСроков(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвития КАК МерыУстойчивогоРазвития,
	|	НастройкиПродленияСроковНалоговОтчетов.РаботаетВНерабочиеДни КАК РаботаетВНерабочиеДни,
	|	НастройкиПродленияСроковНалоговОтчетов.ПеренестиСрокиОтчетовВФонды КАК ПеренестиСрокиОтчетовВФонды,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыУСНЗа2019Год КАК ДатаУплатыУСНЗа2019Год,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыУСНЗа1Кв2020 КАК ДатаУплатыУСНЗа1Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыУСНЗа2Кв2020 КАК ДатаУплатыУСНЗа2Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыУСНЗа3Кв2020 КАК ДатаУплатыУСНЗа3Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыЕНВДЗа1Кв2020 КАК ДатаУплатыЕНВДЗа1Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыЕНВДЗа2Кв2020 КАК ДатаУплатыЕНВДЗа2Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДатаУплатыЕНВДЗа3Кв2020 КАК ДатаУплатыЕНВДЗа3Кв2020,
	|	НастройкиПродленияСроковНалоговОтчетов.ДеятельностьОтнесенаКПострадавшимОтКоронавируса КАК ДеятельностьОтнесенаКПострадавшимОтКоронавируса
	|ИЗ
	|	РегистрСведений.НастройкиПродленияСроковНалоговОтчетов КАК НастройкиПродленияСроковНалоговОтчетов
	|ГДЕ
	|	НастройкиПродленияСроковНалоговОтчетов.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = НовыйНастройкиПродленияСроков();
	
	Результат.ПравилаОтчетовВФонды.Добавить("СтраховыеВзносы.2017_СведенияПФРЕжемесячные");
	Результат.ПравилаОтчетовВФонды.Добавить("СтраховыеВзносы.2020_СведенияЭТКЕжемесячные");
	Результат.ПравилаОтчетовВФонды.Добавить("СтраховыеВзносы.2020_СведенияЭТКЕжедневные");
	
	Результат.ПравилаБезПереносаСроков.Добавить("СтатистическаяОтчетность");
	Результат.ПравилаБезПереносаСроков.Добавить("ДекларированиеАлкогольнойПродукции");
	
	// Сроки представления налоговых деклараций (кроме НДС) продлены для всех организаций
	Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП3Абз1);
	
	// Сроки представления налоговых деклараций по НДС и РСВ продлены для всех организаций
	Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП3Абз2);
	
	// Сроки уплаты торгового сбора продлены для всех организаций-плательщиков торгового сбора
	Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.Постановление212ПП_П2);
	
	// Сроки представления 4-ФСС продлены для всех организаций
	Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.РазъясненияФСС);
	
	// Сроки представления отчетности в Минюст продлены для всех НКО
	Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.РазъясненияМинюста);
	
	Если Выборка.Следующий() Тогда
		
		Результат.Вставить("РаботаетВНерабочиеДни",       Выборка.РаботаетВНерабочиеДни);
		Результат.Вставить("ПеренестиСрокиОтчетовВФонды", Выборка.ПеренестиСрокиОтчетовВФонды);
		Результат.Вставить("ДатаУплатыУСНЗа2019Год",      Выборка.ДатаУплатыУСНЗа2019Год);
		Результат.Вставить("ДатаУплатыУСНЗа1Кв2020",      Выборка.ДатаУплатыУСНЗа1Кв2020);
		Результат.Вставить("ДатаУплатыУСНЗа2Кв2020",      Выборка.ДатаУплатыУСНЗа2Кв2020);
		Результат.Вставить("ДатаУплатыУСНЗа3Кв2020",      Выборка.ДатаУплатыУСНЗа3Кв2020);
		Результат.Вставить("ДатаУплатыЕНВДЗа1Кв2020",     Выборка.ДатаУплатыЕНВДЗа1Кв2020);
		Результат.Вставить("ДатаУплатыЕНВДЗа2Кв2020",     Выборка.ДатаУплатыЕНВДЗа2Кв2020);
		Результат.Вставить("ДатаУплатыЕНВДЗа3Кв2020",     Выборка.ДатаУплатыЕНВДЗа3Кв2020);
		Результат.Вставить("ДеятельностьОтнесенаКПострадавшимОтКоронавируса", Выборка.ДеятельностьОтнесенаКПострадавшимОтКоронавируса);
		
		Если Выборка.МерыУстойчивогоРазвития Тогда
			
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз1);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз2);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз3);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз4);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз5);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1б);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1бИП);
			Результат.ОснованияПродления.Добавить(Перечисления.ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1в);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает период, в рамках которого возможен перенос сроков уплаты налогов и авансовых платежей 
// в соответствии с Федеральным законом от 01.04.2020 № 102-ФЗ
// 
// Возвращаемое значение:
//   - Структура
//	 	- Начало - Дата
//		- Окончание - Дата
//
Функция ПериодПереносаСроковНалоговОтчетов() Экспорт
	
	Период = Новый Структура;
	Период.Вставить("Начало",    '20200101');
	Период.Вставить("Окончание", '20201231');
	
	Возврат Период;
	
КонецФункции	

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация.ГоловнаяОрганизация
	|;
	|РазрешитьЧтение
	|ГДЕ
	| ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	| ЗначениеРазрешено(ЭтотСписок.Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйНастройкиПродленияСроков()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОснованияПродления",          Новый Массив);
	Результат.Вставить("РаботаетВНерабочиеДни",       Ложь);
	Результат.Вставить("ПеренестиСрокиОтчетовВФонды", Ложь);
	Результат.Вставить("ПравилаОтчетовВФонды",        Новый Массив);
	Результат.Вставить("ПравилаБезПереносаСроков",    Новый Массив);
	Результат.Вставить("ДатаУплатыУСНЗа2019Год",      '00010101');
	Результат.Вставить("ДатаУплатыУСНЗа1Кв2020",      '00010101');
	Результат.Вставить("ДатаУплатыУСНЗа2Кв2020",      '00010101');
	Результат.Вставить("ДатаУплатыУСНЗа3Кв2020",      '00010101');
	Результат.Вставить("ДатаУплатыЕНВДЗа1Кв2020",     '00010101');
	Результат.Вставить("ДатаУплатыЕНВДЗа2Кв2020",     '00010101');
	Результат.Вставить("ДатаУплатыЕНВДЗа3Кв2020",     '00010101');
	Результат.Вставить("ДеятельностьОтнесенаКПострадавшимОтКоронавируса", Ложь);
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиОбновления

// Обработчик обновления 3.0.77.69.
// Заполняет настройку МерыУстойчивогоРазвития, если включена МерыУстойчивогоРазвитияМикро.
// Постановление Правительства №570 от 24.04.2020 распространило продление сроков уплаты страховых взносов
// на все организации-субъекты МСП, наиболее пострадавшие от коронавируса, независимо от того, являются ли они микропредприятиями.
//
Процедура ЗаполнитьНастройкиПродленияСроковДляМСП() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПродленияСроковНалоговОтчетов.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиПродленияСроковНалоговОтчетов КАК НастройкиПродленияСроковНалоговОтчетов
	|ГДЕ
	|	НастройкиПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияМикро
	|	И НЕ НастройкиПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвития";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.НастройкиПродленияСроковНалоговОтчетов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
			НаборЗаписей.Прочитать();
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.МерыУстойчивогоРазвития = Истина;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
